<?php

namespace app\models;

use Yii;

/**
 * This is the model class for table "c305_oppp".
 *
 * @property int $id
 * @property string|null $เลขอ้างอิงชื่อไฟล์
 * @property string|null $ชื่อไฟล์
 * @property string|null $รหัสเขต
 * @property string|null $ชื่อเขต
 * @property string|null $รหัสจังหวัด
 * @property string|null $ชื่อจังหวัด
 * @property string|null $รหัสหน่วยบริการ
 * @property string|null $ชื่อหน่วยบริการ
 * @property string|null $รหัสบัตรประชาชน
 * @property string|null $เพศ
 * @property string|null $วันที่เสียชีวิต
 * @property string|null $วันที่เข้ารับบริการ
 * @property string|null $วันที่ส่งข้อมูล
 * @property string|null $ประเภทการบริการ
 * @property string|null $รหัสอ้างอิงจากแฟ้ม_SERVICE
 * @property string|null $รหัสหัตถการแพทย์แผนไทยที่จ่าย
 * @property string|null $รหัสหัตถการแพทย์แผนไทยที่ไม่จ่าย
 * @property string|null $รหัสหัตถการที่ส่งทั้งหมดในวันรับบริการเดียวกัน
 * @property string|null $สิทธิหลัก
 * @property string|null $หน่วยบริการประจำ
 * @property string|null $หน่วยบริการปฐมภูมิ
 * @property string|null $ประเภทกิจกรรมที่ส่งเบิกชดเชย
 * @property string|null $มีการส่งรหัสวินิจฉัยโรค
 * @property string|null $แจ้งผลการตรวจสอบข้อผิดพลาดของข้อมูล
 * @property string|null $สรุปผลการตรวจสอบเบื้องต้น
 * @property string|null $วันที่รับบริการอยู่ในปีงบประมาณ
 * @property string|null $รหัสอ้างอิงข้อมูลสำหรับการติดต่อกับทาง_สปสช
 * @property string|null $created_at
 * @property string|null $updated_at
 */
class C305Oppp extends \yii\db\ActiveRecord
{
    /**
     * {@inheritdoc}
     */
    public static function tableName()
    {
        return 'c305_oppp';
    }
    public static function getDb()
    {
        return Yii::$app->get('db70');
    }
    /**
     * {@inheritdoc}
     */
    public function rules()
    {
        return [
            [['วันที่เสียชีวิต', 'วันที่เข้ารับบริการ', 'วันที่ส่งข้อมูล', 'created_at', 'updated_at'], 'safe'],
            [['รหัสหัตถการแพทย์แผนไทยที่จ่าย', 'รหัสหัตถการแพทย์แผนไทยที่ไม่จ่าย', 'รหัสหัตถการที่ส่งทั้งหมดในวันรับบริการเดียวกัน', 'แจ้งผลการตรวจสอบข้อผิดพลาดของข้อมูล'], 'string'],
            [['เลขอ้างอิงชื่อไฟล์', 'รหัสอ้างอิงจากแฟ้ม_SERVICE', 'สิทธิหลัก', 'มีการส่งรหัสวินิจฉัยโรค'], 'string', 'max' => 50],
            [['รหัสเขต', 'รหัสจังหวัด', 'รหัสหน่วยบริการ', 'เพศ'], 'string', 'max' => 10],
            [['รหัสบัตรประชาชน'], 'string', 'max' => 13],
            [['วันที่รับบริการอยู่ในปีงบประมาณ'], 'string', 'max' => 20],
            [['ชื่อเขต', 'ชื่อจังหวัด', 'ประเภทการบริการ', 'รหัสอ้างอิงข้อมูลสำหรับการติดต่อกับทาง_สปสช'], 'string', 'max' => 150],
            [['ชื่อไฟล์', 'ชื่อหน่วยบริการ', 'หน่วยบริการประจำ', 'หน่วยบริการปฐมภูมิ', 'ประเภทกิจกรรมที่ส่งเบิกชดเชย', 'สรุปผลการตรวจสอบเบื้องต้น'], 'string', 'max' => 255],
        ];
    }

    /**
     * {@inheritdoc}
     */
    public function attributeLabels()
    {
        return [
            'id' => 'ID',
            'เลขอ้างอิงชื่อไฟล์' => 'เลขอ้างอิงชื่อไฟล์',
            'ชื่อไฟล์' => 'ชื่อไฟล์',
            'รหัสเขต' => 'รหัสเขต',
            'ชื่อเขต' => 'ชื่อเขต',
            'รหัสจังหวัด' => 'รหัสจังหวัด',
            'ชื่อจังหวัด' => 'ชื่อจังหวัด',
            'รหัสหน่วยบริการ' => 'รหัสหน่วยบริการ',
            'ชื่อหน่วยบริการ' => 'ชื่อหน่วยบริการ',
            'รหัสบัตรประชาชน' => 'รหัสบัตรประชาชน',
            'เพศ' => 'เพศ',
            'วันที่เสียชีวิต' => 'วันที่เสียชีวิต',
            'วันที่เข้ารับบริการ' => 'วันที่เข้ารับบริการ',
            'วันที่ส่งข้อมูล' => 'วันที่ส่งข้อมูล',
            'ประเภทการบริการ' => 'ประเภทการบริการ',
            'รหัสอ้างอิงจากแฟ้ม_SERVICE' => 'รหัสอ้างอิงจากแฟ้ม SERVICE',
            'รหัสหัตถการแพทย์แผนไทยที่จ่าย' => 'รหัสหัตถการแพทย์แผนไทยที่จ่าย',
            'รหัสหัตถการแพทย์แผนไทยที่ไม่จ่าย' => 'รหัสหัตถการแพทย์แผนไทยที่ไม่จ่าย',
            'รหัสหัตถการที่ส่งทั้งหมดในวันรับบริการเดียวกัน' => 'รหัสหัตถการที่ส่งทั้งหมดในวันรับบริการเดียวกัน',
            'สิทธิหลัก' => 'สิทธิหลัก',
            'หน่วยบริการประจำ' => 'หน่วยบริการประจำ',
            'หน่วยบริการปฐมภูมิ' => 'หน่วยบริการปฐมภูมิ',
            'ประเภทกิจกรรมที่ส่งเบิกชดเชย' => 'ประเภทกิจกรรมที่ส่งเบิกชดเชย',
            'มีการส่งรหัสวินิจฉัยโรค' => 'มีการส่งรหัสวินิจฉัยโรค',
            'แจ้งผลการตรวจสอบข้อผิดพลาดของข้อมูล' => 'แจ้งผลการตรวจสอบข้อผิดพลาดของข้อมูล',
            'สรุปผลการตรวจสอบเบื้องต้น' => 'สรุปผลการตรวจสอบเบื้องต้น',
            'วันที่รับบริการอยู่ในปีงบประมาณ' => 'วันที่รับบริการอยู่ในปีงบประมาณ',
            'รหัสอ้างอิงข้อมูลสำหรับการติดต่อกับทาง_สปสช' => 'รหัสอ้างอิงข้อมูลสำหรับการติดต่อกับทาง สปสช.',
            'created_at' => 'วันที่สร้าง',
            'updated_at' => 'วันที่แก้ไข',
        ];
    }

    /**
     * {@inheritdoc}
     */
    public function behaviors()
    {
        return [
            [
                'class' => \yii\behaviors\TimestampBehavior::class,
                'createdAtAttribute' => 'created_at',
                'updatedAtAttribute' => 'updated_at',
                'value' => date('Y-m-d H:i:s'),
            ],
        ];
    }
}